Repository: argrath/activitypub
Catalog: omegat/omegat/project_save.tmx
Source language: en
Languages: ja

source: Client and server authors should carefully check how their libraries handle requests, and potentially whitelist only certain safe URI types, such as http and https.
ja: クライアントとサーバの作者はライブラリがリクエストをどのように扱うかを 注意深くチェックし、http と https のような、 特定の安全な URI 型のみのホワイトリストを作るべきである。

source: Client to server interaction takes place through clients posting Activities to an actor's outbox.
ja: クライアントからサーバへの通信は、クライアントが actor の outbox に Activitity 投稿することで行われる。

source: Clients MAY give the user the chance to amend this addressing in the UI.
ja: クライアントは UI でユーザーに宛先を変更する機会を与えても良い(MAY)。

source: Clients MAY recurse through attached objects, but if doing so, SHOULD set a limit for this recursion.
ja: クライアントは添付されたオブジェクトを再帰しても良い(MAY)が、 そうする場合はこの再帰に制限を設定するべきである(SHOULD)。

source: Clients SHOULD look at any objects attached to the new Activity via the object, target, inReplyTo and/or tag fields, retrieve their actor or attributedTo properties, and MAY also retrieve their addressing properties, and add these to the to or cc fields of the new Activity being created.
ja: クライアントは、 object, target, inReplyTo, tag フィールドで 新しい Activity に添付されたオブジェクトを見るべきであり(SHOULD)、 その actor や attributedTo 属性を取得して、 また、そのアドレス指定属性を取得して、 作成された新しい Activity の to または cc フィールドに追加してもよい(MAY)。

source: Clients should still be prepared to limit the size of responses they are willing to handle in case they connect to malicious or compromised servers, for example by timing out and generating an error.
ja: クライアントも、悪意あるサーバや故障したサーバと接続する場合に備えて、 例えば時間切れやエラーを生成することで、レスポンスのサイズを制限することに 備えるべきである。

source: Clients submitting the following activities to an outbox MUST provide the object property in the activity: Create, Update, Delete, Follow, Add, Remove, Like, Block, Undo.
ja: 以下のアクティビティを outbox に投稿するクライアントは、 アクティビティに object 属性も提供しなければならない(MUST): Create, Update, Delete, Follow, Add, Remove, Like, Block, Undo。

source: Compacting an ActivityStreams object using the ActivityStreams JSON-LD context might result in https://www.w3.org/ns/activitystreams#Public being represented as simply Public or as:Public which are valid representations of the Public collection.
ja: ActivityStreams JSON-LD コンテキストを使って ActivityStreams オブジェクトを短縮化すると、 https://www.w3.org/ns/activitystreams#Public は、 それぞれバプリックコレクションの正当な表現である、 単に Public および as:Public と 表現できることに注意すること。

source: Cool!
ja: すばらしい!

source: Delivery is usually triggered by, for example:
ja: 配送は通常、例えば以下のもので引き起こされる:

source: Depending on access control, some other content may be public, whereas other content may require authentication for non-owner users, if they can access the inbox at all.
ja: inbox にアクセスできる場合でも、アクセス制御に依存して、その他のコンテンツの 一部はパブリックで、一方その他のコンテンツは非所有者のユーザーは認証を 要求されるかもしれない。

source: Depending on the type of Activity, servers may then be required to carry out further side effects.
ja: Activity の型に依存して、サーバはさらなる副作用を実行することが要求される。

source: Duplication can occur if an activity is addressed both to an actor's followers, and a specific actor who also follows the recipient actor, and the server has failed to de-duplicate the recipients list.
ja: 重複は、あるアクティビティがある actor のフォロワーと、受信 actor を フォローしている特定の actor の両方にアドレス指定され、 サーバが受信リストの重複解消に失敗したときに起こる。

source: Endpoint URI so this actor's clients may access remote ActivityStreams objects which require authentication to access.
ja: actor のクライアントが、 アクセスするのに認証が必要なリモート ActivityStreams にアクセスするのに 使われる エンドポイント URI。

source: Erin Shepherd built the initial version of this specification, borrowed from the ideas in the Pump API document, mostly as a complete rewrite of text, but sharing most of the primary ideas while switching from ActivityStreams 1 to ActivityStreams 2.
ja: Erin Shepherd は、 Pump API 文書のアイデアを借りて、この仕様の初期版を作成した; 文章はほとんど完全に書き換えられたが、ほとんどの基本的なアイデアは共有し、 ActivityStreams 1 から ActivityStreams 2 に切り替えた。

source: Every actor SHOULD have a followers collection.
ja: 各 actor は followers コレクションを 持つべきである(SHOULD)。

source: Every Actor has:
ja: 全てのアクターは次のものを持ちます:

source: Every actor MAY have a liked collection.
ja: 各 actor は liked コレクションを持っても良い(MAY)。

source: Every actor SHOULD have a following collection.
ja: 各 actor は following コレクションを持つべきである(SHOULD)。

source: Every object MAY have a likes collection.
ja: 各オブジェクトは likes コレクションを持ってもよい(MAY)。

source: Every object MAY have a shares collection.
ja: 各オブジェクトは shares コレクションを持っても良い(MAY)。

source: Everything else in this specification is normative.
ja: この仕様におけるその他の全ては規範的である。

source: Failure to properly do so may result in denial-of-service security vulnerabilities.
ja: これを適切に行うことに失敗すると、サービス拒否セキュリティ脆弱性を 起こすことがある。

source: Federated servers MUST perform delivery on all Activities posted to the outbox according to outbox delivery.
ja: 連合サーバは outbox に投稿された全ての Activity を outbox配送 に従って配送を実行しなければならない(MUST)。

source: Feeling happy about things, she decides to post a public message to her followers.
ja: 幸せな気分になったので、彼女は彼女のフォロワーに公開メッセージを 投稿することにしました。

source: First, these recipients are determined through following the appropriate links between objects until you reach an actor, and then the Activity is inserted into the actor's inbox (delivery).
ja: まず、これらの宛先は、actor に到達するまでオブジェクト間の適切なリンクを 辿ることで決定され、 それからこの Activity は actor の inbox に挿入される (delivery)。

source: For client to server interactions, updates are partial; rather than updating the document all at once, any key value pair supplied is used to replace the existing value with the new value.
ja: クライアントからサーバへの通信では、更新は部分的である; 文書全体を一度に更新するのではなく、指定された任意のキー/値の組が 既存の値を新しい値に置き換えるために使われる。

source: For client to server posting, it is possible to submit an object for creation without a surrounding activity.
ja: クライアントからサーバへの投稿で、 周りのアクティビティなしでオブジェクトを作成することも可能である。

source: For example, Undo may be used to undo a previous Like, Follow, or Block.
ja: 例えば、Undo は以前の Like, Follow, Block のいずれかの 取り消しのために使われる。

source: For example, Alyssa P. Hacker likes to post to her ActivityPub powered blog via an Emacs client she has written, leveraging Org mode.
ja: 例えば、Alyssa P.Hacker は、Org mode を 利用して彼女が書いた Emacs クライアントを使って ActivityPub 対応のブログに 投稿するのが好きです。

source: For example, a Profile object might be used as an actor, or a type from an ActivityStreams extension.
ja: 例えば、 Profile オブジェクトが アクターとして使われるかもしれないし、 ActivityStreams 拡張からの型が使われるかもしれない。

source: For example, a server might not send a Reject to protect a user's privacy.
ja: 例えば、サーバはユーザーのプライバシーを守るために Reject を 送信しないかもしれない。

source: For example, if undoing a Like, any counter that had been incremented previously should be decremented appropriately.
ja: 例えば、もし Like を取り消すと、その前にインクリメントされた カウンタは適切にデクリメントされるべきである。

source: For example, many SQL-style databases use an incrementing integer as an identifier, which can be reasonably used for handling insertion order in most cases.
ja: 例えば、多くの SQL スタイルのデータベースは識別子としてインクリメントする 整数を使う; これはほとんどの場合挿入順として合理的に使われる。

source: For example, this protocol is used by a mobile phone application to interact with a social stream of the user's actor.
ja: 例えば、このプロトコルはあるユーザーのactorのソーシャルストリームに 相互作用するモバイルフォンアプリケーションで使われる。

source: For example, when Chris likes the following article by Amy:
ja: 例えば、Chris が Amy による次の記事に「いいね」をするとき:

source: For example:
ja: 例:

source: For federated servers performing delivery to a third party server, delivery SHOULD be performed asynchronously, and SHOULD additionally retry delivery to recipients if it fails due to network error.
ja: 連合サーバがサードパーティーサーバへ配送を実行する場合には、 配送は非同期に実行されるべきであり(SHOULD)、 これがネットワークエラーによって失敗した場合は受信者への配送を 再試行するべきである(SHOULD)。

source: For instance, if attempting to deliver to an actor for perhaps six months while the follower remains unreachable, it is reasonable that the delivering server remove the subscriber from the followers list.
ja: 例として、ある actor への配送の試みが例えば 6 ヶ月間フォロワーに 到達不能であり続けた場合、配送サーバがその購読者を followers から 削除するのは合理的である。

source: For non-transient objects, the server MUST attach an id to both the wrapping Create and its wrapped Object.
ja: 非一時的オブジェクトに関しては、 サーバはラッピングした Create とラップされた Object に対して、id を 添付しなければならない(MUST)。

source: For server to server interactions, an Update activity means that the receiving server SHOULD update its copy of the object of the same id to the copy supplied in the Update activity.
ja: サーバからサーバへの通信では、 Update アクティビティは、 同じ id の object のコピーを、 Update アクティビティの中に供給されているコピーで 更新するべきである(SHOULD)。

source: For servers hosting many actors, delivery to all followers can result in an overwhelming number of messages sent.
ja: 多くの actor をホスティングしているサーバでは、 全てのフォロワーへの配送は大量のメッセージを送信することになることがある。

source: For this purpose, ID normalization SHOULD be performed as follows:
ja: この目的のため、ID 正規化は以下のように行われるべきである(SHOULD):

source: HTTP caching mechanisms [RFC7234] SHOULD be respected when appropriate, both in clients receiving responses from servers as well as servers sending responses to clients.
ja: HTTP キャッシュ機構 [RFC7234] は、 クライアントがサーバから応答を受信する場合とサーバがクライアントに 応答を送信する場合の両方において、適切な場合には遵守するべきである(SHOULD)。

source: HTTP caching mechanisms [RFC7234] SHOULD be respected when appropriate, both when receiving responses from other servers as well as sending responses to other servers.
ja: 他のサーバからの返答を受信するときと他のサーバへ返答を送信するときの 両方において、適切な場合には HTTP キャッシュ機構 [RFC7234] に 遵守するべきである(SHOULD)。

source: Her phone polls her inbox via GET, and amongst a bunch of cat videos posted by friends and photos of her nephew posted by her sister, she sees the following:
ja: 彼女のスマートフォンは彼女の inbox を GET でポーリングし、 友人が投稿した大量の猫動画や姉が投稿した甥の写真の中から、 彼女は次のメッセージを見つけます:

source: Here's an example of the record of our friend Alyssa P. Hacker:
ja: 以下は、我が友 Alyssa P.Hacker の記録の例です:

source: Here's the message she composes, as an ActivityStreams object:
ja: 以下は、彼女が書いた、ActivityStreams オブジェクトとしての メッセージです。

source: Hey nice, so just as a recap:
ja: では、ここでおさらいです:

source: However, ActivityPub implementations which wish to be more broadly compatible with Linked Data Notifications implementations may wish to support other RDF representations.
ja: しかし、より広く Linked Data Notifications 実装と互換性を持たせたい ActivityPub 実装は、その他の RDF 表現に対応した方がよい。

source: However, Ben has no access to see the members of Alyssa's followers collection, so his server does not forward his messages to their inbox.
ja: しかし、Ben は Alyssa のフォロワーコレクションの内容にアクセス出来ないので、 Ben のサーバは彼のメッセージを彼らの inbox に転送できません。

source: However, actors MAY have a sharedInbox endpoint which is available for efficient shared delivery of public posts (as well as posts to followers-only); see 7.1.3 Shared Inbox Delivery.
ja: しかし、 actor はパブリックな投稿の効率的な共有配送のために利用可能である sharedInbox エンドポイントを 持ってもよい(MAY); 7.1.3 Shared Inbox Delivery を参照のこと。

source: However, for client to server communication, a server receiving an object posted to the outbox with no specified id SHOULD allocate an object ID in the actor's namespace and attach it to the posted object.
ja: しかし、クライアントからサーバへの通信では、id の指定なしに outbox に投稿されたオブジェクトを受信したサーバは、 その actor の名前空間の ID を割り当て、投稿されたオブジェクトに それを添付するべきである(SHOULD)。

source: However, it can be difficult for implementations to determine which @language property to provide for user-submitted content.
ja: しかし、ユーザーが投稿したコンテンツに対してどの @language 属性 を 提供するかを決定するのは実装上難しいかもしれない。

source: However, once you've implemented one, it isn't too many steps to implement the other, and there are a lot of benefits to both (making your website part of the decentralized social web, and being able to use clients and client libraries that work across a wide variety of social websites).
ja: しかし、一旦一つを実装すれば、もう一つを実装するのにそれほど多くの ステップはなく、両方に多くの利益があります (web サイトを非中央集権型ソーシャル web にし、様々なソーシャル web サイトで 動作するクライアントとクライアントライブラリを使えるようにします)。

source: However, permitting requests to localhost in a production client or server instance can be dangerous.
ja: しかし、製品版クライアントやサーバインスタンスで localhost への リクエストを許すことは危険なことがある。

source: However, servers may still implement one without the other.
ja: しかし、それでもサーバはもう片方なしで片方を実装できる。

source: However, since bto and bcc are only intended to be known/seen by the original author of the object/activity, servers should omit these properties during display as well.
ja: しかし、bto と bcc はオブジェクト/アクティビティの 元の作者のみによって知られる/見られることを意図しているので、 サーバは表示においてこれらの属性を省略するべきである。

source: However, this mostly happens in general with processing activities delivered to an inbox anyway.
ja: しかし、これはとにかく inbox にアクティビティが配送されたときに ほとんど一般的に処理されることである。

source: Identifiers MUST be provided for activities posted in server to server communication, unless the activity is intentionally transient.
ja: 識別子は、アクティビティが意図的に一時的なものでない限り、 サーバからサーバへの通信で投稿するアクティビティでは 提供しなければならない(MUST)。

source: If Linked Data Signatures and HTTP Signatures are being used for authentication and authorization, this endpoint specifies a URI at which a client key may be signed by the actor's key for a time window to act on behalf of the actor in interacting with foreign servers.
ja: Linked Data Signatures と HTTP Signatures が認証と認可として使われている場合、 このエンドポイントは 外部サーバと通信する際に actor に代わって動作するタイミングのための、 actor のキーによって署名されるクライアントキーの URI を指定する。

source: If Linked Data Signatures and HTTP Signatures are being used for authentication and authorization, this endpoint specifies a URI at which browser-authenticated users may authorize a client's public key for client to server interactions.
ja: Linked Data Signatures と HTTP Signatures が認証と認可として使われている場合、 このエンドポイントはブラウザ認証ユーザーが クライアントからサーバへの通信 の ためのクライアントの公開鍵を認証する URI を指定する。

source: If OAuth 2.0 bearer tokens [RFC6749] [RFC6750] are being used for authenticating client to server interactions, this endpoint specifies a URI at which a browser-authenticated user may obtain a new authorization grant.
ja: OAuth 2.0 bearer トークン [RFC6749] [RFC6750] が クライアントからサーバへの通信 の 認証として使われる場合、 このエンドポイントは、ブラウザ認証ユーザーが新しい認証グラントを得るための URI を指定する。

source: If OAuth 2.0 bearer tokens [RFC6749] [RFC6750] are being used for authenticating client to server interactions, this endpoint specifies a URI at which a client may acquire an access token.
ja: OAuth 2.0 bearer トークン [RFC6749] [RFC6750] が クライアントからサーバへの通信 の 認証として使われる場合、 このエンドポイントは、クライアントがアクセストークンを得るための URI を指定する。

source: If a recipient is a Collection or OrderedCollection, then the server MUST dereference the collection (with the user's credentials) and discover inboxes for each item in the collection.
ja: 宛先が Collection または OrderedCollection の場合、 サーバはコレクションを(ユーザーの認証情報と共に)展開し、コレクションの それぞれの要素の inbox を発見しなければならない(MUST)。

source: If a user submits a request without Authorization the server should respond with all of the Public posts.
ja: ユーザーが Authorization なしでリクエストを投稿した場合、 サーバは全ての Public 投稿を 応答するべきである。

source: If an Activity is submitted with a value in the id property, servers MUST ignore this and generate a new id for the Activity.
ja: id 属性付きの Activity が投稿されたとき、 サーバはこれを無視してこの Activity のための新しい id を 生成しなければならない(MUST)。

source: If it appears that the user neglected to add a scheme for a URI that would otherwise be considered valid, such as example.org/alice/, clients MAY attempt to provide a default scheme, preferably https.
ja: example.org/alice/ のように、ユーザーが URI にスキームを追加するのを怠ったがそれ以外は有効であるように 見える場合、クライアントはデフォルトのスキーム (https が望ましい) を提供しようとしても良い(MAY)。

source: If the object of a Reject received to an inbox is a Follow activity previously sent by the receiver, this means the recipient did not approve the Follow request.
ja: inbox に受信した Reject の object が、以前受信者によって送られた Follow アクティビティの場合、 これは受け取り側が Follow リクエストを承認しなかったことを 意味する。

source: If the object of an Accept received to an inbox is a Follow activity previously sent by the receiver, the server SHOULD add the actor to the receiver's Following Collection.
ja: inbox に受信した Accept の object が、以前受信者によって送られた Follow アクティビティの場合、 サーバは 受信者の Following Collection に actor を追加するべきである(SHOULD)。

source: If the deleted object is requested the server SHOULD respond with either the HTTP 410 Gone status code if a Tombstone object is presented as the response body, otherwise respond with a HTTP 404 Not Found.
ja: 削除されたオブジェクトが要求された場合、サーバは、 レスポンスボディとして Tombstone オブジェクトが表現されている場合は HTTP 410 Gone ステータスを、 さもなければ HTTP 404 Not Found ステータスを返すべきである (SHOULD)。

source: If the entered ID is a valid URI, then it is to be used directly.
ja: 入力された ID が有効な URI の場合、これが直接使われる。

source: If the object is just sent to the "public" collection the object is not delivered to any actors but is publicly viewable in the actor's outbox.
ja: もしオブジェクトが単に「パブリック」コレクションに送信された場合、 オブジェクトは誰にも配送されないが、アクターの outbox で公に閲覧可能になる。

source: If you don't, don't worry, JSON-LD documents and ActivityStreams can be understood as plain old simple JSON.
ja: もしそうでなくても、心配は要りません; JSON-LD 文書と ActivityStreams は どちらも単なる単純な JSON として理解すればよいです。

source: If you edit, you'll lose your original source!"
ja: これを編集すると、元のソースが失われます!」

source: If you know what JSON-LD is, you can take advantage of the cool linked data approaches provided by JSON-LD.
ja: あなたが JSON-LD について知っているなら、JSON-LD によって提供される クールなリンク付きデータ手法の有用性を使えます。

source: If your ActivityPub server or client does permit making requests to localhost URIs for development purposes, consider making it a configuration option which defaults to off.
ja: 自作の ActivityPub サーバやクライアントが開発目的のために localhost URI への リクエストを許す場合、デフォルトでオフの設定オプションにすることを 考慮すること。

source: Implementations MAY provide the following properties:
ja: 実装は以下の属性を提供しても良い(MAY):

source: Implementations MAY, in addition, provide the following properties:
ja: 実装は、これに加えて、以下の属性を提供しても良い(MAY):

source: Implementations MUST NOT deliver to the "public" special collection; it is not capable of receiving actual activities.
ja: 実装者は「パブリック」特殊コレクションへ配送してはならない(MUST NOT); これは実際の activity を受信する能力を持たない。

source: Implementations SHOULD, in addition, provide the following properties:
ja: 実装は、これに加えて、以下の属性を提供するべきである(SHOULD):

source: Implementations should be aware that there is no guarantee that actors on the network will remain reachable and should implement accordingly.
ja: 実装は、ネットワーク上の actor が到達可能であり続ける保証がないことに注意し、 それに応じて実装するべきである。

source: Implementations which treat ActivityStreams objects as simply JSON rather than converting an incoming activity over to a local context using JSON-LD tooling should be aware of this and should be prepared to accept all three representations.
ja: ActivityStreams に関して、 受信したアクティビティを JSON-LD ツールを使ってローカルなコンテキストに 変換するのではなく、単に JSON として扱う実装はこれに注意するべきで、 3 種類全ての表現を受け付けるように準備するべきである。

source: Implementers MAY include additional context as appropriate.
ja: 実装者は追加の context を必要に応じて含んでも良い(MAY)。

source: Implementers SHOULD include the ActivityPub context in their object definitions.
ja: 実装者はそのオブジェクト定義に ActivityPub context を含むべきである(SHOULD)。

source: Implementers interested in alternative approaches and complementary protocols should review [Micropub] and the overview document [Social-Web-Protocols].
ja: 代替手法と補完するプロトコルに関心のある実装者は、 [Micropub] と 概観文書 [Social-Web-Protocols] を調査すると良い。

source: In ActivityPub, a user is represented by "actors" via the user's accounts on servers.
ja: ActivityPub では、ユーザーはサーバ上のアカウントを通して アクター として表現されます。

source: In addition to JSON-LD compacted ActivityStreams documents, Linked Data Notifications also supports a number of RDF serializations which are not required for ActivityPub implementations.
ja: JSON-LD コンパクト化 ActivityStreams 文書に加えて、 Linked Data Notifications は、ActivityPub 実装で必要でない様々な RDF 直列化も対応している。

source: In addition to [ActivityStreams] collections and objects, Activities may additionally be addressed to the special "public" collection, with the identifier https://www.w3.org/ns/activitystreams#Public.
ja: [ActivityStreams] コレクションとオブジェクトに加えて、 activity は追加で特殊な「パブリック」コレクションを宛先に指定できる; これは識別子 https://www.w3.org/ns/activitystreams#Public である。

source: In addition to all the properties defined by the [Activity-Vocabulary], ActivityPub extends the Object by supplying the source property.
ja: [Activity-Vocabulary] で定義されている全ての属性に加えて、 ActivityPub は Object に source 属性を提供するように拡張する。

source: In addition, whenever requirements are specified, it is called out whether they apply to the client or server (for the client-to-server protocol) or whether referring to a sending or receiving server in the server-to-server protocol.
ja: さらに、要件が指定される場合、(クライアント-サーバプロトコルでは) クライアントとサーバのどちらに適用されるかが明示され、 サーバ間プロトコルでは送信サーバと受信サーバのどちらを参照するかが 明示される。

source: In general, clients do the conversion from source to content, not the other way around.
ja: 一般的に、クライアントは source から content への変換を行い、逆は行わない。

source: In general, it's best to let a user edit their original post in the same source format they originally composed it in.
ja: 一般的に、元々作成したのと同じソース形式でユーザーに元の投稿を編集させるのが 最善である。

source: In general, the owner of an inbox is likely to be able to access all of their inbox contents.
ja: 一般的に、inbox の所有者は その inbox のコンテンツ全てにアクセスできる。

source: In order to prevent a client from being overloaded by oversized Collections, servers should take care to limit the size of Collection pages they return to clients.
ja: 大きすぎるコレクションによってクライアントが過負荷になることを防ぐために、 サーバはクライアントに返すコレクションページの大きさを制限することに 注意するべきである。

source: In order to propagate updates throughout the social graph, Activities are sent to the appropriate recipients.
ja: ソーシャルグラフ上に更新を伝搬させるために、Activity は適切な宛先に 送信される。

source: In other databases, an insertion time timestamp may be preferred.
ja: その他のデータベースでは、挿入時刻タイムスタンプが好まれるかもしれない。

source: In particular, much of this specification is informed by OStatus and the Pump API, as pioneered by StatusNet (now GNU Social) and Pump.io.
ja: 特に、この仕様の多くの部分は、 StatusNet (現在は GNU Social) と Pump.io によって開拓された OStatus と Pump API から 情報を受けている。

source: In particular, thanks to: Aaron Parecki, AJ Jordan, Benjamin Goering, Caleb Langeslag, Elsa Balderrama, elf Pavlik, Eugen Rochko, Erik Wilde, Jason Robinson, Manu Sporny, Michael Vogel, Mike Macgirvin, nightpool, Puck Meerburg, Sandro Hawke, Sarven Capadisli, Tantek Çelik, and Yuri Volkov.
ja: 特に、次の方々に感謝する: Aaron Parecki, AJ Jordan, Benjamin Goering, Caleb Langeslag, Elsa Balderrama, elf Pavlik, Eugen Rochko, Erik Wilde, Jason Robinson, Manu Sporny, Michael Vogel, Mike Macgirvin, nightpool, Puck Meerburg, Sandro Hawke, Sarven Capadisli, Tantek Çelik, and Yuri Volkov.

source: In particular, the inbox property is the same between ActivityPub and Linked Data Notifications, and the targeting and delivery systems described in this document are supported by Linked Data Notifications.
ja: 特に、inbox 属性は ActivityPub と Linked Data Notifications で 同じで、この文書に記述されているターゲットと配送の機構は Linked Data Notifications に支えられている。

source: In sum:
ja: まとめると:

source: In the case of a Reject, the server MUST NOT add the actor to the object actor's Followers Collection.
ja: Reject の場合、object の actor の Followers Collection に actor を 追加してはならない(MUST NOT)。

source: In the case of receiving an Accept referencing this Follow as the object, the server SHOULD add the actor to the object actor's Followers Collection.
ja: この Follow を object として参照している Accept を 受信する場合、サーバは object の actor の Followers Collection に actor を追加するべきである(SHOULD)。

source: In this case the activity is a Create of a Note object, posted by a Person).
ja: この場合は、アクティビティは Person によって投稿される Note オブジェクトの Create です。)

source: Indeed, federation happens usually by servers posting messages sent by actors to actors on other servers' inboxes.
ja: 実際には、連合は普通サーバが他のサーバのactorのinboxに送るときに起こります。

source: It ensures that the server will not distribute so many activities that it triggers another server's denial-of-service protections.
ja: 他のサーバの サービス不能攻撃保護を 引き起こすような大量のアクティビティを配信しないようにする。

source: It is a stable document and may be used as reference material or cited from another document.
ja: これは安定した文書であり、参考資料として使用したり、他の文書から引用したりすることができる。

source: It is called out whenever a portion of the specification only applies to implementation of the federation protocol.
ja: これは、仕様のうち、連合プロトコルの実装にのみ適用されるものに付記される。

source: It is often convenient while developing to test against a process running on localhost.
ja: 開発中、localhost で実行したプロセスに対してテストするのはしばしば有用である。

source: It prevents malicious clients from conducting denial-of-service attacks on the server.
ja: 悪意のあるクライアントがサーバにサービス不能攻撃を仕掛けるのを防止する。
